module Terms

def self.terms_of_service
 html = <<-HTML
（１）前文

本サービス利用規約では、本サービス提供者、IT.KoolBZ（以下、提供者)が提供する、OzJapaneseのサービス（以下、サービス)、
およびサービスにより提供されるサイトの利用にあたっての規約を示す規約である。
利用者は、本サービスを利用する場合、本規約に従うことをあらかじめ合意しているものとする。

（２）用語の定義

利用者とは、インターネットを通じて、サービスのサイトにアクセスし、サイトで提供されるすべてのコンテンツを閲覧、利用するすべてのユーザーを示す。
コンテンツとは、本サイトにて提供する全ての情報であり、提供者、利用者、他の利用者からの投稿など表示される情報の他に、
非表示であるが、サイトから取得可能な全ての情報である。

（３）提供するサービスの内容

提供するサービスの内容を以下に示す。

・サイトに利用者がインターネットを通じてアクセスし、サイト上で提供されるコンテンツを閲覧可能。
・利用者は、他のサイトが提供するIDとパワードを使って本サイトにログインすることができる。
・利用者は、ログインの上、サイトのコンテンツに投稿できる。
・利用者は、ログインの上、サイトのコンテンツにコメントを投稿できます。
・提供者は、サイト上にて、スポンサー企業または個人のコンテンツを掲載可能。
・利用者は、サイト上にて、スポンサー企業または、個人のコンテンツを閲覧可能。
・登録されたメールアドレスに対して、サイトから定期的な情報の発信

利用者の義務は以下の通りです。

・利用者は、提供者により許可された範囲で、すべてのコンテンツを閲覧可能。
・利用者は、提供されるコンテンツの内容に準ずる投稿を追加可能。
・利用者は、提供者または、他の利用者が投稿したコンテンツに対してコメントを投稿可能。
・利用者は、利用者が投稿する内容に関する情報に関して全ての責任を持ちます。
・利用者は、本サイト利用にあたり、本規約で禁止された事項を行わない。
・利用者は、投稿した内容について、提供者に削除依頼を行うことができる。
・利用者は、本サイトを通して、提供者に対して、意見、感想、問題の報告、フィードバックの提供を実施可能。
・利用者は、サイト上に表示される利用情報（リンク、プロファイル）などに他人がアクセスし、参照することに同意する。
・利用者は、退会、データ削除の依頼をサイト上から行うことができる。

提供者は、利用者の投稿により発生した、いかなる事故、第三者への損害に対して、一切の責任を持たない。

利用者は、提供者が、以下の事柄を行うことを合意することとします。

・利用者の承諾を得ることなく、いつでもサービス内容および本規約を変更
・変更内容の通知は、サイトへの掲載により実施（利用者へのメールなどでの連絡は実施しない）

（４）利用料金について

利用者は無料でサービスを利用できる。
ただし、提供者は、一部、またはすべてのサービスの利用を有償とする場合がありえる。
利用者はサービス利用にあたって、これに合意するものとする。
有償とする場合、提供者は、利用者に一定期間を持って事前に通知し、有償開始まで、一定期間を設定するものとします。

提供者は、本サイトに広告や情報の掲載を希望するスポンサー企業、またはスポンサー個人（以下、スポンサー）に対して掲載料金を設定することができます。
その場合、料金設定、支払方法は、提供者が指定するものとします。
料金表、支払い方法については、提供者とスポンサーの間で別途取り交わすものとする。

（５）サービス提供の開始と提供日・時間

サービス提供は、利用者が本サイトに初回にアクセスした時点とする。
IDやパスワードの登録、発行、変更、削除、電子証明書等の発行は、本サイトでは実施しない。

本サイトにアクセスした時点で、利用者は、「利用者の意志に基づく申し込み」を完了したものとし、
提供者は「提供者の申し込み承諾」を実施したものとします。

サービス提供日と時間は、３６５日２４時間を原則として、メンテナンスの時間を除く。
提供者、都合によりメンテナンスを定期的、または不定期に行う。
メンテナンスによりサービスを中断する場合は、提供者は一定の猶予を持ってサイト上にて、通知する。
提供者が、一部、または全てのサービスの提供を終了する場合も、提供者は一定の猶予を持ってサイト上にて、通知する。
一部、または全てのサービスを終了する場合、提供者は、関連するサイト上の全てのデータを削除する。

（６）サービス利用に必要な機器等

サービスを受けるために必要な端末機器、通信設備、その他の設備等は、利用者の負担とします。
本サイトにアクセスする場合に発生する、通信費などについては、一切利用者の負担とします。

（７）IDやパスワード等の管理

本サイトでは、他のサイトで提供されるIDやパスワードにて認証を行うため、IDやパスワード、電子証明書（認証書）等の管理は実施しない。
本サイトの認証に使用する他のサイトのIDやパスワードの管理は利用者の責任とする。
IDやパスワード管理から派生する責任（利用者、第三者に対する損害等）について、提供者は一切の責任を持たない。

IDやパスワード、認証情報が不正使用される可能性がある場合には、利用者は提供者に連絡する義務を有する。
IDやパスワード、認証情報の不正使用により生じた損害等について、提供は一切の責任を持たない。
ただし、利用者から連絡があった場合、提供者は、可能な限りの対応と対策を、一定期間を持って、実施するものとします。

（８）禁止事項

本サービス上で、以下の事項は禁止します。
・IDやパスワード等を第三者に開示、貸与又は譲渡する行為
・他人のIDやパスワードにより不正にログインする行為。
・他人の認証情報（トークン、セッション）を盗むまたは、それを利用したサイトへのアクセス
・許可なく、提供情報の一部又は全部を複製、送信、転載、配布、頒布等の方法により、第三者に提供する行為
・有害なコンピュータプログラムを送信または書き込む行為
・銀行口座、クレジット番号などの個人情報を他人に尋ねる行為または、それを本サイト上で提供する行為。
・サイト上で他人を中傷する行為、その他人権を損害する行為。
・提供者の運営を妨害する行為、信用を毀損する行為
・法令に違反する行為（違反するおそれのある行為を含む）

上記行為は、規約違反以外にも、刑法、著作権法などの法律による刑事罰の適用を受ける可能性があります。

（９）プライバシーと個人情報について

別冊の個人情報管理規約に準じます。

（１０）損害賠償と免責

利用者の規約違反により提供者に損害が生じた場合、提供者は、その損害を賠償することができます。

免責事項は以下の通り。

・機器の故障、人災、天災等の理由により、サービス提供の中断、停止、提供情報の遅配等が発生した場合の責任
・提供情報の内容（正確性等）についての責任
・提供情報を利用したことによる第三者への損害等に対する責任
・利用者の端末機器やソフトウェア等への影響についての責任

（１１）契約の終了と解除

契約の終了については、利用者から契約終了の通知があった時とします。
契約の終了と同時にサービスの提供も終了します。
通知の方法については、無料利用者は、本サイトから退会依頼メールを提供者に送信することによって実施します。
有償利用者、依頼者は、別途契約時にの内容に定められた終了規則に従います。


以下の事由が生じた場合、提供者は契約の解除（またはサービス停止）を事前の通知なしに直ちに処置できる。

・利用者の破産、和議開始、会社更生法手続開始、会社整理開始等の申し立てがあったとき
・利用者が手形交換所の取引停止処分を受けたとき
・利用者の財産について、仮差し押さえ、仮処分、保全差し押さえ、強制執行などが行われたとき
・利用者が規約に定められた義務を履行しないとき
・その他、利用者について契約を継続しがたい重要な事実が生じたと提供者が認めたとき

などがあります。法人（企業等）を対象とせず、利用者を個人（自然人）に限定する場合は、もう少し簡素化しても良いでしょう。

また、契約が終了した後にも存続する義務や適用される規定を明記しておくことも必要でしょう。具体的には、

・禁止事項について
・プライバシーと個人情報について
・損害賠償と免責事項について
・譲渡禁止と機密保持について
・知的所有権について

などが考えられます。

（１２）譲渡禁止と機密保持について

利用者が許可なく、契約上の地位や権利義務を第三者に譲渡等をすることを禁止する。
利用者、提供者共に、契約によって知り得た相手方の業務上の情報を秘密に保持する。

（１３）知的所有権について

サービス内容、コンテンツ、利用規約の著作権、その他知的所有権などの権利をすべて提供者が留保する。
利用者はサービス利用にあたって、これを承諾するものとする。

（１４）分離可能性と権利不放棄

契約内容の一部が無効とされた場合も、その他の部分については有効であることを定めます。具体的には、

・規約に定める権利の行使、実施の怠慢が、その権利の放棄を意味しないこと
・規約中のいずれかの条項が、ある管轄地において無効、違法等の判断を受けた場合でも、その他の条項はなお効力を有し存続すること

などを定めます。

（１５）通知

提供者と利用者が連絡する必要がある場合通知（請求、依頼等を含む）、
提供者は、利用者のメールアドレスまたは、連絡電話番号にて連絡をとる。

メールアドレス等については、サイトへのログイン、連絡のさいに登録されたものを使用する。

（１６）完全なる合意

本規定は、従前の口頭もしくは書面による交渉、約束、了解にかかわらず、提供者と利用者の完全な合意を構成するものとします。

（１７）言語

本規約文書は日本語で作成されています。

（１８）準拠法と裁判管轄

本規約の執行可能性、解釈および有効性は、オーストラリア国法に従って判断されるものとします。
提供者と利用者は、本規約に関するいかなる紛争も、ブリスベン地方裁判所を専属的管轄裁判所にすることに同意します。

All Rights Reserved. Copyright 2012 IT.KoolBZ

HTML
html.html_safe
end

def self.terms_of_personal_info
   html = <<-HTML
<h6>個人情報の取得および利用</h6>
<p>
当サイトにおける個人情報の取得は、当サイト上で提供するサービスの充実ならび蓄積する場合に円滑な提供(提携事業者によるサービスの提供を含む)および当サイトの円滑な運営を目的とし、その目的の達成に必要な範囲内で行います。
</p>
<p>
取得した個人情報は、取得目的の範囲内で利用し、これらの目的以外で利用する場合には、利用者に対し事前に確認または同意を求めます。
</p>
<h6>個人情報の取得手段</h6>
<p>
個人情報の取得は、当サイト上にログインした場合に取得を行います。
当サイト上での個人情報の取得にあたっては、ご提供時における確認欄等へのクリックによって本人の同意を得たものとします。
</p>
<h6>個人情報の第三者への開示・提供の制限</h6>
<p>
当サイトでは、次のいずれかに該当する場合を除き、個人情報を第三者に開示・提供いたしません。
</p>
<ul>
<li>
ご本人の同意がある場合
</li>
<li>
人の生命・身体または財産の保護のために必要な場合であって、緊急を要するなど、ご本人の同意を得ることが困難である場合
</li>
<li>
国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、ご本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがある場合
</li>
<li>
事業の承継に伴って個人情報を提供する場合
</li>
<li>
利用目的の達成に必要な範囲内において、業務委託先に開示または提供する場合
※この場合は、個人情報の取扱いに関する契約の締結等により、当該業務委託先において個人情報の適切な取扱いが確保されるよう必要かつ適切な監督を行います。
</li>
<li>
その他法令等に基づき第三者に対する開示または提供が許される場合
</li>
<ui>
HTML
html.html_safe
end
end
