module Terms

def self.terms_of_service
 html = <<-HTML
（１）前文

本サービス利用規約では、本サービス提供者、IT.KoolBZ（以下、提供者)が提供する、OzJapaneseのサービス（以下、サービス)、
およびサービスにより提供されるサイトの利用にあたっての規約を示します。
利用者は、本サービスを利用する場合、本規約に従うことをあらかじめ合意しているものとします。

（２）用語の定義

利用者とは、インターネットを通じて、サービスのサイトにアクセスし、サイトで提供されるすべてのコンテンツを閲覧、利用するすべてのユーザーを示します。

（３）提供するサービスの内容

本サービスでは、以下を提供します。

提供するサービスの内容と、それに対する利用者の義務を定めます。
サービス全体の説明に加えて、具体的な情報の種類を箇条書きで説明するのが良いでしょう。
また、詳しい利用方法を説明するマニュアル等を別途用意しておくと、利用者には喜ばれます。FAQ（よくある質問）コーナーなども有効です。

提供者は、以下の事柄を行うことを利用者は合意することとします。

・利用者の承諾を得ることなく、いつでもサービス内容および本規約を変更可能
・変更内容の通知は、サイトへの掲載により実施する

利用者は、退会、データ削除の依頼をサイト上から行うことができます。

（４）利用料金について

利用者は無料でサービスを利用できます。
ただし、提供者は、一部、またはすべてのサービスの利用を有償とする場合があります。
利用者はサービス利用にあたって、これに合意するものとします。
有償とする場合、提供者は、ある一定期間を設定し、利用者に通知するものとします。

提供者は、本サイトに広告や情報を掲載したい企業、個人（依頼者）に対して掲載料金を設定することができます。
その場合、料金、支払方法は、提供者が指定するものとします。
料金表、支払い方法については、提供者と依頼者の間で別途取り交わすこととします。

（５）サービス提供の開始と提供日・時間

サービス提供の開始は、Web上で申し込み手続をする場合は、メールでの確認等（いたずら等の防止）が終了した後、IDやパスワード、電子証明書等を発行した時からとするのが一般的でしょう。利用者にとっては、できるだけ簡単な申し込み手続で、できるだけ早くサービスの提供を受けたいというのが一般的でしょう。

ただし、法律的には、「利用者の意志に基づく申し込み」と「提供者の申し込み承諾」という行為が必須なものとなることを理解しておきましょう。書面による申し込み手続の場合は、この点を明確にしやすいというメリットがあります。

サービス提供日と時間は、３６５日２４時間を原則として、メンテナンスの時間を除くのが一般的です。メンテナンス時間については、定期的に行うものと不定期に行うものを具体的に挙げておくと良いでしょう。

（６）サービス利用に必要な機器等

サービスを受けるために必要な端末機器、通信設備、その他の設備等は、利用者の負担とします。
本サイトにアクセスする場合に発生する、通信費などについては、一切利用者の負担とします。

（７）IDやパスワード等の管理

IDやパスワード、電子証明書（認証書）等の管理については、利用者の責任とします。派生する責任（利用者、第三者に対する損害等）についての放棄なども明記します。

不正使用される可能性がある場合には、提供者に連絡する義務を課し、その後の手続（廃棄、再発行等）についても明記します。

不正使用されたことにより生じた損害等についても責任を放棄しておくのが良いですが、利用者から連絡があった後、提供者の対応が遅れた場合などは責任放棄することはできないと考えておきましょう。

（８）禁止事項

本サービス上で、以下の事項は禁止します。

・IDやパスワード等を第三者に開示、貸与又は譲渡する行為
・他人のIDやパスワードにより不正にログインする行為。
・許可なく、提供情報の一部又は全部を複製、送信、転載、配布、頒布等の方法により、第三者に提供する行為
・有害なコンピュータプログラムを送信または書き込む行為
・銀行口座、クレジット番号などの個人情報を他人に尋ねる行為または、それを本サイト上で提供する行為。
・提供者の運営を妨害する行為、信用を毀損する行為
・法令に違反する行為（違反するおそれのある行為を含む）

上記行為は、規約違反以外にも、刑法、著作権法などの法律による刑事罰の適用を受ける可能性があります。

（９）プライバシーと個人情報について

利用者にとっては大変気になる、プライバシーや個人情報の取扱いについての定めです。入手した利用者の個人情報を、第三者に対して販売・交換等をしないこととしますが、利用者本人の事前承諾を得た場合を除くとしておくのが良いでしょう。

ただし、本人の事前承諾は積極的なものであることが必要になってきています。さらに進んだ形として、本人の要求に基づく個人情報の訂正・削除などを定めておくことも良いでしょう。

（１０）損害賠償と免責

損害賠償については、利用者の規約違反により提供者に損害が生じた場合、その損害を賠償する義務があることを定めます。

免責については、具体的な例示を含めて免責事項を挙げておきます。例えば、

・機器の故障、人災、天災等の理由により、サービス提供の中断、停止、提供情報の遅配等が発生した場合の責任
・提供情報の内容（正確性等）についての責任
・提供情報を利用したことによる第三者への損害等に対する責任
・利用者の端末機器やソフトウェア等への影響についての責任

（１１）契約の終了と解除

契約の終了については、利用者から契約終了の通知があった時とするのが良いでしょう。契約の終了と同時にサービスの提供も終了するとするのが一般的です。通知の方法については、メールやWeb送信、書面などが考えられますが、契約内容（無料、有償等）によって使い分けるのが良いでしょう。通知の効果は到達によって生じることを確認しておくのも有効です。

契約の解除（またはサービス停止）については、事由を箇条書きにして挙げておき、その事由が生じた場合、事前の通知なしに直ちに処置できるようにしておきます。ただし、一方的な解除については利用者のデメリットが大きいので、書面による通知を条件としておくのが良いでしょう。事由の具体例としては、

・利用者の破産、和議開始、会社更生法手続開始、会社整理開始等の申し立てがあったとき
・利用者が手形交換所の取引停止処分を受けたとき
・利用者の財産について、仮差し押さえ、仮処分、保全差し押さえ、強制執行などが行われたとき
・利用者が規約に定められた義務を履行しないとき
・その他、利用者について契約を継続しがたい重要な事実が生じたと提供者が認めたとき

などがあります。法人（企業等）を対象とせず、利用者を個人（自然人）に限定する場合は、もう少し簡素化しても良いでしょう。

また、契約が終了した後にも存続する義務や適用される規定を明記しておくことも必要でしょう。具体的には、

・禁止事項について
・プライバシーと個人情報について
・損害賠償と免責事項について
・譲渡禁止と機密保持について
・知的所有権について

などが考えられます。

（１２）譲渡禁止と機密保持について

この場合の譲渡禁止とは、お互いの権利を、相手に無断で譲渡することを禁止するという意味です。利用者が許可なく、契約上の地位や権利義務を第三者に譲渡等をしないように定めます。

機密保持については、利用者、提供者共に、契約によって知り得た相手方の業務上の情報を秘密に保持することを定めておきます。

（１３）知的所有権について

著作権等の知的所有権について定めます。

原則として、サービス内容、利用マニュアル、利用規約の著作権、その他知的所有権などの権利をすべて提供者が留保していることを、利用者に承諾させるように定めておくのが良いでしょう。

（１４）分離可能性と権利不放棄

契約内容の一部が無効とされた場合も、その他の部分については有効であることを定めます。具体的には、

・規約に定める権利の行使、実施の怠慢が、その権利の放棄を意味しないこと
・規約中のいずれかの条項が、ある管轄地において無効、違法等の判断を受けた場合でも、その他の条項はなお効力を有し存続すること

などを定めます。

（１５）通知

お互いが連絡する場合の通知（請求、依頼等を含む）する際の方法や、その効果について定めます。

原則として厳格な方法（配達証明付の書留郵便など）として、規約中に別段の定めがある場合を除くとしておくと、柔軟に対応できます。迅速な対応が必要な事項については、電話、ファックス、メール等を利用した方法を別途定めれば良いのです。

通知のあて先となる住所、メールアドレス等については、契約申込書に記されたものを利用することとして、いつでも変更できるようにしておくのが良いでしょう。

（１６）完全なる合意

規約が、両者の最終的な合意であることを定めます。例えば、

本規定は、従前の口頭もしくは書面による交渉、約束、了解にかかわらず、○○と●●の完全な合意を構成するものとします。

といった感じです。

（１７）言語

規約と全ての関連文書は日本語で作成されることを定めます。

使用する言語については、サービス内容や対象となる利用者によって変わってきますが、できるだけ提供者が理解しやすい言語または準拠法や裁判管轄となる国の言語に合わせておくのが良いでしょう。

（１８）準拠法と裁判管轄

裁判になって争われる場合の、適用される法律と裁判管轄を定めます。例えば、

本規約の執行可能性、解釈および有効性は、日本国法に従って判断されるものとします。

○○と●●は、本規約に関するいかなる紛争も東京地方裁判所を専属的管轄裁判所にすることに同意します。

といった感じです。

最初または最後に　All Rights Reserved. Copyright 2000 ●●　も入れておきましょう。

HTML
html.html_safe
end

def self.terms_of_personal_info
   html = <<-HTML
<h6>個人情報の取得および利用</h6>
<p>
当サイトにおける個人情報の取得は、当サイト上で提供するサービスの充実ならび蓄積する場合に円滑な提供(提携事業者によるサービスの提供を含む)および当サイトの円滑な運営を目的とし、その目的の達成に必要な範囲内で行います。
</p>
<p>
取得した個人情報は、取得目的の範囲内で利用し、これらの目的以外で利用する場合には、利用者に対し事前に確認または同意を求めます。
</p>
<h6>個人情報の取得手段</h6>
<p>
個人情報の取得は、当サイト上にログインした場合に取得を行います。
当サイト上での個人情報の取得にあたっては、ご提供時における確認欄等へのクリックによって本人の同意を得たものとします。
</p>
<h6>個人情報の第三者への開示・提供の制限</h6>
<p>
当サイトでは、次のいずれかに該当する場合を除き、個人情報を第三者に開示・提供いたしません。
</p>
<ul>
<li>
ご本人の同意がある場合
</li>
<li>
人の生命・身体または財産の保護のために必要な場合であって、緊急を要するなど、ご本人の同意を得ることが困難である場合
</li>
<li>
国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、ご本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがある場合
</li>
<li>
事業の承継に伴って個人情報を提供する場合
</li>
<li>
利用目的の達成に必要な範囲内において、業務委託先に開示または提供する場合
※この場合は、個人情報の取扱いに関する契約の締結等により、当該業務委託先において個人情報の適切な取扱いが確保されるよう必要かつ適切な監督を行います。
</li>
<li>
その他法令等に基づき第三者に対する開示または提供が許される場合
</li>
<ui>
HTML
html.html_safe
end
end